cache/posts/instcombine-debugging-reference.html
<p>
Instruction Combine is a crucial pass occurring in the middle of the pipeline.
It consolidates redundant instructions and while doing that it doesn't always get
the Debug Info right.
</p>

<div id="outline-container-org30cbab4" class="outline-2">
<h2 id="org30cbab4">Code structure</h2>
<div class="outline-text-2" id="text-org30cbab4">
<p>
The pass is split into many different files. The class definition
along with the definition of the instruction work-list is 
in <code>llvm/include/llvm/Transforms/InstCombine</code> while the implementation lies
in <code>llvm/lib/Transforms/InstCombine</code>. The main cpp file is 
<code>/home/gramanas/code/llvm/lib/Transforms/InstCombine/InstructionCombining.cpp</code>
</p>

<p>
The pass runs on a function level.
</p>
</div>
</div>

<div id="outline-container-org1af67ab" class="outline-2">
<h2 id="org1af67ab">Debugging</h2>
<div class="outline-text-2" id="text-org1af67ab">
<p>
In order to see what the pass is doing step by step use this:
</p>

<div class="highlight"><pre><span></span>opt -debug-only<span class="o">=</span>instcombine -instcombine sample.ll
</pre></div>
</div>
</div>

<div id="outline-container-org37c9ba9" class="outline-2">
<h2 id="org37c9ba9">Example</h2>
<div class="outline-text-2" id="text-org37c9ba9">
<p>
The following llvm-ir snippet:
</p>

<div class="highlight"><pre><span></span>define &lt;2 x i64&gt; @test3(&lt;2 x i64&gt; %A) {
  %trunc = trunc &lt;2 x i64&gt; %A to &lt;2 x i32&gt;
  %and = and &lt;2 x i32&gt; %trunc, &lt;i32 23, i32 42&gt;
  %zext = zext &lt;2 x i32&gt; %and to &lt;2 x i64&gt;
  ret &lt;2 x i64&gt; %zext
}
</pre></div>

<p>
gets reduced to this:
</p>

<div class="highlight"><pre><span></span>define &lt;2 x i64&gt; @test3(&lt;2 x i64&gt; %A) {                                                                                                                                              
  %and = and &lt;2 x i64&gt; %A, &lt;i64 23, i64 42&gt;                                                                                                                                          
  ret &lt;2 x i64&gt; %and                                                                                                                                                                 
}
</pre></div>

<p>
after running <code>instcombine</code> on it.
</p>

<p>
We are left with two dbg.value intrinsics missing.
</p>
</div>
</div>
